In [ ]:
import pandas as pd
import matplotlib.pyplot as plt
import os
import seaborn as sns 
import numpy as np 
from tqdm import tqdm
import random
import datetime as dt

In [ ]:
PATH = '/Users/krc/Desktop/project/system_quality_project/data/'

tre = pd.read_csv(PATH + 'train_err.csv')
tse = pd.read_csv(PATH + 'test_err.csv')

# tre.time = pd.to_datetime(tre.time.astype('str'))
# tre.time 
# tse.head()

In [ ]:
def make_date(x):
    x = str(x)
    year = int(x[0:4])
    month = int(x[4:6])
    day = int(x[6:8])
    hour = int(x[8:10])
    minute = int(x[10:12])
    sec = int(x[12:])
    return dt.datetime(year,month,day,hour,minute,sec)
    
# tse['datetime'] = tse.time.apply(make_date)
# tse

In [ ]:
tre.time = pd.to_datetime(tre.time)

In [ ]:
# tse.drop(columns='time').to_csv(PATH + 'test_err.csv',index= False)

In [ ]:
tp = pd.read_csv(PATH + 'train_problem_data.csv')
tp.time = tp.time.apply(make_date)
p_user = tp.user_id.unique()
# p_user, set(p_user)
np_user = list(set(tre.user_id.unique()) -set(p_user))

In [ ]:
tq = pd.read_csv(PATH + 'train_quality_data.csv')

tqq = tq[['time','user_id']].drop_duplicates().reset_index(drop = True)
tqq.time = tqq.time.apply(make_date)
# tqq 시간과 user_id 만 쓰네 ;

/var/folders/t3/j8459bg97zb7x34h0c_jgnlr0000gn/T/ipykernel_2248/3691190635.py:1: DtypeWarning: Columns (10,11,12) have mixed types. Specify dtype option on import or set low_memory=False.
  tq = pd.read_csv(PATH + 'train_quality_data.csv')

In [ ]:
tqq

                     time  user_id
0     2020-11-29 09:00:00    10000
1     2020-11-30 21:00:00    10000
2     2020-11-04 11:00:00    10002
3     2020-11-06 01:00:00    10002
4     2020-11-11 01:00:00    10002
...                   ...      ...
68947 2020-11-30 20:30:00    24993
68948 2020-11-28 20:20:00    24995
68949 2020-11-29 00:20:00    24995
68950 2020-11-08 23:00:00    24997
68951 2020-11-24 03:30:00    24997

[68952 rows x 2 columns]

In [ ]:
# tpd=tp.user_id.value_counts().to_frame().reset_index()
# tpd.columns = ['user_id','count_e'] # columns 명을 이렇게도 바꿀수있구만
# tpd
# 컬러명 가져오기?

def check_unique(col,df1,df2):
    def change_len(x):
        if len(x) == 10:
            return x[:5]
        else:
            return x
    print('about',col)
    if col == 'fwver':
        train_c = set(df1[col].apply(change_len).unique())
        test_c = set(df2[col].apply(change_len).unique())
        print("train only in %s" %col,train_c -test_c)
        print("test only in %s"%col,test_c - train_c)
         # 차집합 개념이구나
        total = (train_c | test_c)
        
    else:
        train_c = set(df1[col].unique())
        test_c = set(df2[col].unique())
        print("train only in %s" %col,train_c -test_c)
        print("test only in %s"%col,test_c - train_c)
         # 차집합 개념이구나
        total = (train_c | test_c)
        # 합집합
        
model_total=check_unique('model_nm',tre,tse)
errtype_total=check_unique('errtype',tre,tse)
fwver_total = check_unique('fwver',tre,tse)

about model_nm
train only in model_nm set()
test only in model_nm set()
about errtype
train only in errtype set()
test only in errtype set()
about fwver
train only in fwver set()
test only in fwver {'10.22'}

In [ ]:
%%time
def change_len(x):
        if len(x) == 10:
            return x[:5]
        else:
            return x
set(tre['fwver'].apply(change_len).unique())

CPU times: user 1.89 s, sys: 138 ms, total: 2.02 s
Wall time: 2.02 s

{'03.11',
 '04.16',
 '04.22',
 '04.33',
 '04.73',
 '04.82',
 '05.15',
 '05.66',
 '10',
 '8.5.3'}

In [ ]:
%%time
set(tre['fwver'])

CPU times: user 619 ms, sys: 1.77 ms, total: 620 ms
Wall time: 620 ms

{'03.11.1141',
 '03.11.1149',
 '03.11.1167',
 '04.16.2641',
 '04.16.3345',
 '04.16.3439',
 '04.16.3553',
 '04.16.3569',
 '04.16.3571',
 '04.22.1442',
 '04.22.1656',
 '04.22.1666',
 '04.22.1684',
 '04.22.1750',
 '04.22.1778',
 '04.33.1095',
 '04.33.1125',
 '04.33.1149',
 '04.33.1171',
 '04.33.1185',
 '04.33.1261',
 '04.73.2237',
 '04.73.2571',
 '04.82.1684',
 '04.82.1730',
 '04.82.1778',
 '05.15.2090',
 '05.15.2092',
 '05.15.2114',
 '05.15.2120',
 '05.15.2122',
 '05.15.2138',
 '05.15.3104',
 '05.66.3237',
 '05.66.3571',
 '10',
 '8.5.3'}

In [ ]:
pd.options.display.max_columns = 50
pd.options.display.max_rows = 200

In [ ]:
t1 = tre.loc[tre.errtype==1]
        
t11 = t1.user_id.value_counts().describe().to_frame().T.rename(index ={'user_id':1})
pnumber = len(t1.loc[t1.user_id.isin(p_user)].user_id.unique())
npnumber = len(t1.loc[t1.user_id.isin(np_user)].user_id.unique())

t11['p_counts'] = pnumber
print(round((pnumber/1)*100,2))
t11

24200.0

   count       mean        std  min  25%   50%   75%    max  p_counts
1  950.0  22.645263  18.925383  1.0  2.0  30.0  30.0  171.0       242

In [ ]:
len(tre.loc[(tre.errtype==1) & (tre.loc[tre.errtype==1].user_id.isin(p_user))])/1#/1

4014.0

In [ ]:
def get_distribution_errtype():
    total = []
    for num in range(1,43):
        if num == 29:
            continue
        t1 = tre.loc[tre.errtype==num]
        
        t11 = t1.user_id.value_counts().describe().to_frame().T.rename(index ={'user_id':num})
        pnumber = len(t1.loc[t1.user_id.isin(p_user)].user_id.unique())
        npnumber = len(t1.loc[t1.user_id.isin(np_user)].user_id.unique())
        
        t11['p_counts'] = pnumber
        t11['npnumber'] = npnumber
        # if pnumber+npnumber == 0:
            # t11['p_ratio'] =  round((pnumber/1)*100,2)
        # else:
        t11['p_ratio'] = round((pnumber/(pnumber+npnumber))*100,2)
        total.append(t11)
    return pd.concat(total).reset_index().rename(columns={'index':'errtype'})

errtype_distribution = get_distribution_errtype()

errtype_distribution

,errtype,count,mean,std,min,25%,50%,75%,max,p_counts,npnumber,p_ratio
0,1,950.0,22.645263,18.925383,1.0,2.0,30.0,30.0,171.0,242,708,25.47
1,2,390.0,66.920513,352.584466,1.0,2.0,2.0,6.0,4056.0,168,222,43.08
2,3,1679.0,18.163788,208.580954,1.0,1.0,2.0,4.0,7239.0,465,1214,27.70
3,4,6881.0,187.761372,2774.102374,1.0,1.0,16.0,151.0,195024.0,2298,4583,33.40
4,5,11010.0,57.246140,163.044126,1.0,3.0,8.0,35.0,4207.0,4028,6982,36.58
5,6,6467.0,7.798516,47.282503,1.0,1.0,2.0,4.0,1796.0,2662,3805,41.16
6,7,7648.0,6.795502,46.745625,1.0,1.0,2.0,4.0,2687.0,3093,4555,40.44
7,8,64.0,2.453125,1.851037,1.0,1.0,2.0,3.0,12.0,13,51,20.31
8,9,63.0,1.730159,2.444258,1.0,1.0,1.0,1.0,17.0,38,25,60.32
9,10,2360.0,29.166102,236.123915,1.0,1.0,2.0,6.0,7311.0,1134,1226,48.05
10,11,14767.0,20.668044,95.277239,1.0,13.0,15.0,16.0,7317.0,4971,9796,33.66
11,12,14799.0,21.545172,96.042676,1.0,14.0,15.0,18.0,7324.0,4974,9825,33.61
12,13,3711.0,3.266774,24.943569,1.0,1.0,1.0,3.0,1111.0,1667,2044,44.92
13,14,7891.0,30.314536,314.507094,1.0,2.0,4.0,8.0,10765.0,3224,4667,40.86
14,15,14545.0,107.426401,67.785539,1.0,64.0,102.0,142.0,1526.0,4978,9567,34.22
15,16,14431.0,86.490333,63.414517,1.0,47.0,78.0,114.0,1530.0,4977,9454,34.49
16,17,5747.0,7.990778,16.532297,1.0,1.0,4.0,11.0,460.0,2498,3249,43.47
17,18,1768.0,1.510747,1.815140,1.0,1.0,1.0,1.0,41.0,1521,247,86.03
18,19,419.0,1.584726,1.720786,1.0,1.0,1.0,2.0,23.0,346,73,82.58
19,20,1546.0,1.345408,1.139906,1.0,1.0,1.0,1.0,23.0,1333,213,86.22
20,21,381.0,1.593176,1.742610,1.0,1.0,1.0,2.0,22.0,316,65,82.94
21,22,10281.0,181.256201,657.517370,1.0,28.0,43.0,88.0,15944.0,3975,6306,38.66
22,23,10046.0,226.558929,968.268174,1.0,10.0,26.0,79.0,26495.0,3920,6126,39.02
23,24,2519.0,15.507741,87.195064,1.0,1.0,2.0,7.0,2866.0,1166,1353,46.29
24,25,420.0,2.819048,5.631960,1.0,1.0,1.0,3.0,78.0,360,60,85.71
25,26,13026.0,40.764471,19.355023,1.0,31.0,39.0,52.0,235.0,4632,8394,35.56
26,27,2267.0,92.691222,779.816197,1.0,1.0,2.0,50.0,26482.0,958,1309,42.26
27,28,2275.0,94.654066,809.567512,1.0,1.0,2.0,48.0,27643.0,959,1316,42.15
28,30,375.0,1.072000,0.288162,1.0,1.0,1.0,1.0,4.0,260,115,69.33
29,31,11091.0,178.977279,392.298912,1.0,103.0,159.0,226.0,37589.0,4153,6938,37.44
30,32,1933.0,584.711330,903.120230,1.0,14.0,160.0,809.0,5637.0,927,1006,47.96
31,33,11074.0,16.098158,10.244832,1.0,13.0,15.0,16.0,183.0,4138,6936,37.37
32,34,3733.0,30.761586,247.943701,1.0,2.0,5.0,13.0,9745.0,1963,1770,52.59
33,35,2039.0,4.984306,24.349229,1.0,1.0,1.0,3.0,828.0,1186,853,58.17
34,36,8435.0,1.104564,0.334516,1.0,1.0,1.0,1.0,6.0,3262,5173,38.67
35,37,8434.0,1.106948,0.343587,1.0,1.0,1.0,1.0,6.0,3259,5175,38.64
36,38,1822.0,2.491218,7.223481,1.0,1.0,1.0,2.0,234.0,927,895,50.88
37,39,766.0,20.651436,54.690716,1.0,2.0,6.0,18.0,965.0,405,361,52.87
38,40,10462.0,69.803384,88.824322,1.0,16.0,43.0,92.0,1695.0,4052,6410,38.73
39,41,6142.0,16.178444,28.109564,1.0,2.0,7.0,22.0,969.0,2596,3546,42.27
40,42,6382.0,5.374021,3.605925,1.0,2.0,5.0,8.0,33.0,2490,3892,39.02

In [ ]:
tre[tre.errtype == 29]

Empty DataFrame
Columns: [user_id, time, model_nm, fwver, errtype, errcode]
Index: []

In [ ]:
def make(num):
    err =  tre.loc[tre.errtype==num]
    users = err.user_id.unique()
    # users2 = err.user_id.value_counts().to_frame().index # 굳이 이렇게 하나 싶어서 바꿈
    # t2 = err.loc[err.user_id.isin(users)]
    err2 = err.copy()
    err2['err_'+str(num)] = err2.time.dt.hour # datatime 객체로 되있는거에서 year hour등등 만 뽑을라면 .dt.뽑으려는것
    # 으로 해야되더라고요 판다스 series 에서 시간 처리하는 메소드 였네요 근데 이건 저장했다가 불려오면그냥 str로 읽어 오는게되서
    # 다시한번 date time으로 바꿔 주는 과정이 필요한것 같아요 실험 해보야 되여
    
    p = err2.loc[err2.user_id.isin(p_user)] # 만들어놓은 problem의 유저랑
    np = err2.loc[err2.user_id.isin(np_user)] # problem 접수안한 유저로  또 구분해준다 각각 에러타입 별
    
    display(p)
    pdf = p['err_'+str(num)].value_counts().sort_index().to_frame().T.rename(index = {'err_'+str(num):\
                                                                                      'err_p'+str(num)})
    npdf = np['err_'+str(num)].value_counts().sort_index().to_frame().T.rename(index = {'err_'+str(num):\
                                                                                      'err_np'+str(num)})
    # 위에서 에러 발생 hour 을 컬럼으로 만들어줘서
    # 밑에 보이는 것처럼 transpose해서 err_type 이 어느 시간에 얼마나 발생했는지 볼수있게만들었고 
    # 그걸 또 불만접수 여부로 나누었다
    
    # f는 불만접수 여부 나눈 dataframe을 합친것이다
    f = pd.concat([pdf,npdf])
    display(f)
    f2 = f.copy()
    f = f.fillna(0)
    
    f = round(f)
    # 뭔가 소수점이 있었나본데 값이
    # 굳이 copy해서 두개를 뽑은 이유는 모름
    display(f.info())
    return f, f2
# make라는 함수를 만들어서 매개변수로 errtype 숫자들을 받아 errtype 별로 데이터 프레임 만들고
make(1)

,user_id,time,model_nm,fwver,errtype,errcode,err_1
168129,10168,2020-11-01 02:17:02,model_4,03.11.1167,1,0,2
168151,10168,2020-11-02 05:18:05,model_4,03.11.1167,1,0,5
168209,10168,2020-11-04 04:26:36,model_4,03.11.1167,1,0,4
168214,10168,2020-11-05 03:49:02,model_4,03.11.1167,1,0,3
168227,10168,2020-11-06 02:43:56,model_4,03.11.1167,1,0,2
...,...,...,...,...,...,...,...
15365110,24990,2020-11-28 19:56:22,model_4,03.11.1167,1,0,19
15365117,24990,2020-11-29 03:02:20,model_4,03.11.1167,1,0,3
15365120,24990,2020-11-29 18:19:52,model_4,03.11.1167,1,0,18
15365139,24990,2020-11-30 07:10:49,model_4,03.11.1167,1,0,7
15365147,24990,2020-11-30 21:10:33,model_4,03.11.1167,1,0,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p1,13,8,903,908,879,542,18,40,79,35,45,27,24,32,28,43,48,43,49,63,51,67,43,26
err_np1,78,40,3971,3874,4168,2058,123,146,154,151,157,165,170,173,243,245,237,215,261,259,199,156,150,106

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p1 to err_np1
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

(         0   1     2     3     4     5    6    7    8    9    10   11   12  \
 err_p1   13   8   903   908   879   542   18   40   79   35   45   27   24
 err_np1  78  40  3971  3874  4168  2058  123  146  154  151  157  165  170

           13   14   15   16   17   18   19   20   21   22   23
 err_p1    32   28   43   48   43   49   63   51   67   43   26
 err_np1  173  243  245  237  215  261  259  199  156  150  106  ,
          0   1     2     3     4     5    6    7    8    9    10   11   12  \
 err_p1   13   8   903   908   879   542   18   40   79   35   45   27   24
 err_np1  78  40  3971  3874  4168  2058  123  146  154  151  157  165  170

           13   14   15   16   17   18   19   20   21   22   23
 err_p1    32   28   43   48   43   49   63   51   67   43   26
 err_np1  173  243  245  237  215  261  259  199  156  150  106  )

In [ ]:
t = []

for v in range(1,43): # 왜 v라고 했는지 모르겠지만 errtype의 숫자들을 하나씩 뽑는 for 문
    if v == 29:
        pass
    else:
        
        df ,_ = make(v)
        t.append(df)

,user_id,time,model_nm,fwver,errtype,errcode,err_1
168129,10168,2020-11-01 02:17:02,model_4,03.11.1167,1,0,2
168151,10168,2020-11-02 05:18:05,model_4,03.11.1167,1,0,5
168209,10168,2020-11-04 04:26:36,model_4,03.11.1167,1,0,4
168214,10168,2020-11-05 03:49:02,model_4,03.11.1167,1,0,3
168227,10168,2020-11-06 02:43:56,model_4,03.11.1167,1,0,2
...,...,...,...,...,...,...,...
15365110,24990,2020-11-28 19:56:22,model_4,03.11.1167,1,0,19
15365117,24990,2020-11-29 03:02:20,model_4,03.11.1167,1,0,3
15365120,24990,2020-11-29 18:19:52,model_4,03.11.1167,1,0,18
15365139,24990,2020-11-30 07:10:49,model_4,03.11.1167,1,0,7
15365147,24990,2020-11-30 21:10:33,model_4,03.11.1167,1,0,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p1,13,8,903,908,879,542,18,40,79,35,45,27,24,32,28,43,48,43,49,63,51,67,43,26
err_np1,78,40,3971,3874,4168,2058,123,146,154,151,157,165,170,173,243,245,237,215,261,259,199,156,150,106

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p1 to err_np1
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_2
137239,10134,2020-11-23 19:59:30,model_3,05.15.2138,2,1,19
137240,10134,2020-11-23 19:59:38,model_3,05.15.2138,2,0,19
281971,10306,2020-11-21 01:27:29,model_0,04.22.1750,2,1,1
281972,10306,2020-11-21 01:27:30,model_0,04.22.1750,2,0,1
281973,10306,2020-11-21 01:27:57,model_0,04.22.1750,2,1,1
...,...,...,...,...,...,...,...
15078804,24779,2020-11-02 19:55:11,model_2,04.33.1185,2,0,19
15324580,24951,2020-11-26 22:51:25,model_0,04.22.1778,2,1,22
15324581,24951,2020-11-26 22:51:26,model_0,04.22.1778,2,0,22
15340821,24966,2020-11-27 19:59:25,model_1,04.16.3553,2,1,19
15340822,24966,2020-11-27 19:59:26,model_1,04.16.3553,2,0,19

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p2,444,747,500,274,209,123,51,213,264,323,387,131,255,216,144,247,147,463,342,803,428,525,961,1111
err_np2,1196,828,425,503,425,376,334,367,632,275,845,684,477,586,442,578,908,514,1790,1044,982,805,836,939

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p2 to err_np2
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_3
24112,10019,2020-11-24 15:00:12,model_3,05.15.2138,3,2,15
92207,10088,2020-11-14 04:33:18,model_3,05.15.2138,3,2,4
115799,10115,2020-11-05 13:15:18,model_3,05.15.2138,3,1,13
136902,10134,2020-11-10 18:22:06,model_3,05.15.2138,3,2,18
136919,10134,2020-11-11 15:43:12,model_3,05.15.2138,3,2,15
...,...,...,...,...,...,...,...
15338650,24965,2020-11-18 04:41:45,model_4,03.11.1167,3,1,4
15364488,24990,2020-11-01 09:54:47,model_4,03.11.1167,3,1,9
15364811,24990,2020-11-15 20:19:23,model_4,03.11.1167,3,1,20
15364865,24990,2020-11-19 07:06:18,model_4,03.11.1167,3,1,7
15365069,24990,2020-11-26 06:54:33,model_4,03.11.1167,3,1,6

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p3,348,505,390,484,692,788,697,600,445,549,635,659,568,556,580,604,675,646,485,698,605,651,612,360
err_np3,666,543,638,704,660,951,789,953,595,566,547,529,501,589,658,649,621,644,802,802,805,879,879,695

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p3 to err_np3
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_4
3501,10004,2020-11-10 03:24:11,model_0,04.22.1750,4,1,3
4213,10005,2020-11-10 14:29:54,model_0,04.22.1750,4,1,14
4940,10006,2020-11-14 00:34:00,model_1,04.16.3553,4,1,0
15044,10011,2020-11-20 04:25:49,model_0,04.22.1750,4,1,4
23381,10019,2020-11-01 06:49:19,model_3,05.15.2138,4,0,6
...,...,...,...,...,...,...,...
15365137,24990,2020-11-29 21:27:16,model_4,03.11.1167,4,0,21
15365140,24990,2020-11-30 07:10:49,model_4,03.11.1167,4,0,7
15365146,24990,2020-11-30 21:10:32,model_4,03.11.1167,4,0,21
15365150,24990,2020-11-30 21:21:42,model_4,03.11.1167,4,0,21
15366904,24997,2020-11-17 23:10:49,model_0,04.22.1750,4,1,23

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p4,12703,12974,13712,13293,13771,15304,16324,19946,18241,16866,15817,15431,13716,13268,11943,14537,14914,16206,18657,20057,14410,14270,13169,12545
err_np4,34169,30652,34893,35199,37091,38229,39082,44463,43512,41295,39249,37227,37134,38438,37437,37329,39680,41482,42846,42713,41698,42372,39386,34336

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p4 to err_np4
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_5
328,10001,2020-11-02 00:23:05,model_2,04.33.1185,5,B-A8002,0
329,10001,2020-11-02 00:23:10,model_2,04.33.1185,5,B-A8002,0
330,10001,2020-11-02 00:23:11,model_2,04.33.1185,5,B-A8002,0
331,10001,2020-11-02 00:23:12,model_2,04.33.1185,5,B-A8002,0
332,10001,2020-11-02 00:23:18,model_2,04.33.1185,5,B-A8002,0
...,...,...,...,...,...,...,...
15367233,24997,2020-11-28 12:09:00,model_0,04.22.1778,5,B-A8002,12
15367234,24997,2020-11-28 12:09:04,model_0,04.22.1778,5,B-A8002,12
15367235,24997,2020-11-28 12:09:06,model_0,04.22.1778,5,B-A8002,12
15367236,24997,2020-11-28 12:09:10,model_0,04.22.1778,5,B-A8002,12
15367237,24997,2020-11-28 12:09:11,model_0,04.22.1778,5,B-A8002,12

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p5,11445,8049,6352,4797,4319,3940,4187,6374,9487,11826,13792,14639,14244,14005,14378,13122,14256,13867,15566,17505,17076,18294,15523,12997
err_np5,15059,9745,8330,6700,5878,5095,4722,8763,11546,14311,14027,15314,16899,18772,17590,17797,16553,16681,18148,22265,23427,23264,20635,18719

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p5 to err_np5
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_6
455,10001,2020-11-05 04:06:21,model_2,04.33.1185,6,14,4
3266,10004,2020-11-01 02:47:46,model_0,04.22.1750,6,14,2
3549,10004,2020-11-11 05:54:35,model_0,04.22.1750,6,14,5
3682,10004,2020-11-18 06:36:26,model_0,04.22.1750,6,14,6
4830,10006,2020-11-09 21:16:45,model_1,04.16.3553,6,14,21
...,...,...,...,...,...,...,...
15365027,24990,2020-11-24 19:17:28,model_4,03.11.1167,6,1,19
15365033,24990,2020-11-25 07:00:18,model_4,03.11.1167,6,1,7
15365078,24990,2020-11-26 21:50:12,model_4,03.11.1167,6,1,21
15365115,24990,2020-11-28 19:56:56,model_4,03.11.1167,6,1,19
15366892,24997,2020-11-17 01:54:56,model_0,04.22.1750,6,14,1

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p6,1018,958,1023,1098,935,1153,1040,1030,1017,1061,1168,1307,1325,1454,1422,1370,1344,1333,1252,1193,1152,1162,1183,1169
err_np6,730,929,976,1200,1016,1364,1153,1291,732,793,914,780,753,936,978,889,884,782,860,834,825,859,916,872

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p6 to err_np6
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_7
456,10001,2020-11-05 04:06:28,model_2,04.33.1185,7,14,4
3267,10004,2020-11-01 02:47:47,model_0,04.22.1750,7,14,2
3550,10004,2020-11-11 05:54:35,model_0,04.22.1750,7,14,5
3621,10004,2020-11-14 21:02:34,model_0,04.22.1750,7,14,21
3681,10004,2020-11-18 06:36:20,model_0,04.22.1750,7,14,6
...,...,...,...,...,...,...,...
15364730,24990,2020-11-12 00:39:45,model_4,03.11.1167,7,1,0
15364776,24990,2020-11-14 14:40:31,model_4,03.11.1167,7,1,14
15364795,24990,2020-11-15 10:38:26,model_4,03.11.1167,7,1,10
15364829,24990,2020-11-16 21:18:22,model_4,03.11.1167,7,1,21
15366890,24997,2020-11-17 01:54:53,model_0,04.22.1750,7,14,1

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p7,1019,933,1070,1104,995,1188,1051,1054,1023,1071,1223,1986,1538,1593,1452,1389,1462,1373,1299,1304,1264,1212,1207,1207
err_np7,693,778,916,950,922,1315,1112,1225,637,678,865,1470,847,1018,1009,905,870,791,793,820,781,838,909,813

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p7 to err_np7
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_8
922701,10974,2020-11-09 11:02:30,model_0,04.22.1750,8,PHONE_ERR,11
922702,10974,2020-11-09 11:02:39,model_0,04.22.1750,8,PHONE_ERR,11
922703,10974,2020-11-09 11:02:50,model_0,04.22.1750,8,PHONE_ERR,11
922704,10974,2020-11-09 11:03:09,model_0,04.22.1750,8,PHONE_ERR,11
922705,10974,2020-11-09 11:03:19,model_0,04.22.1750,8,PHONE_ERR,11
1554976,11623,2020-11-03 13:10:59,model_3,05.15.2138,8,PHONE_ERR,13
1554977,11623,2020-11-03 13:11:03,model_3,05.15.2138,8,PHONE_ERR,13
1695652,11759,2020-11-14 11:57:45,model_3,05.15.2138,8,PHONE_ERR,11
1695653,11759,2020-11-14 11:57:50,model_3,05.15.2138,8,PHONE_ERR,11
2670308,12739,2020-11-06 23:16:04,model_2,04.33.1185,8,PHONE_ERR,23
2670309,12739,2020-11-06 23:16:12,model_2,04.33.1185,8,PHONE_ERR,23
2670310,12739,2020-11-06 23:16:15,model_2,04.33.1185,8,PHONE_ERR,23
2860411,12943,2020-11-14 10:39:41,model_1,04.16.3553,8,20,10
3008163,13056,2020-11-24 16:46:40,model_0,04.22.1778,8,20,16
3008166,13056,2020-11-24 16:46:57,model_0,04.22.1778,8,20,16
4251890,14363,2020-11-07 21:10:19,model_1,04.16.3553,8,PHONE_ERR,21
4251891,14363,2020-11-07 21:10:29,model_1,04.16.3553,8,PHONE_ERR,21
5225553,15238,2020-11-15 17:54:25,model_4,03.11.1167,8,PHONE_ERR,17
5225554,15238,2020-11-15 17:54:30,model_4,03.11.1167,8,PHONE_ERR,17
8696773,18561,2020-11-23 20:22:42,model_2,04.33.1261,8,PHONE_ERR,20
11642573,21259,2020-11-28 13:00:59,model_2,04.33.1261,8,PHONE_ERR,13
11642574,21259,2020-11-28 13:01:03,model_2,04.33.1261,8,PHONE_ERR,13
11642575,21259,2020-11-28 13:01:07,model_2,04.33.1261,8,PHONE_ERR,13
11642576,21259,2020-11-28 13:01:10,model_2,04.33.1261,8,PHONE_ERR,13
12614399,22307,2020-11-02 18:23:45,model_0,04.22.1750,8,PHONE_ERR,18
12615800,22307,2020-11-27 16:15:16,model_0,04.22.1778,8,PHONE_ERR,16
13094342,22805,2020-11-12 00:49:24,model_0,04.22.1750,8,PHONE_ERR,0
14499499,24262,2020-11-28 11:05:24,model_1,04.16.3553,8,PHONE_ERR,11

,0,10,11,13,16,17,18,20,21,23,1,6,8,9,12,14,15,19,22
err_p8,1,1,8,6,3,2,1.0,1,2,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
err_np8,4,12,7,1,5,3,NaN,5,5,11,4.0,3.0,2.0,7.0,5.0,5.0,10.0,13.0,27.0

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p8 to err_np8
Data columns (total 19 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   10      2 non-null      int64
 2   11      2 non-null      int64
 3   13      2 non-null      int64
 4   16      2 non-null      int64
 5   17      2 non-null      int64
 6   18      2 non-null      float64
 7   20      2 non-null      int64
 8   21      2 non-null      int64
 9   23      2 non-null      int64
 10  1       2 non-null      float64
 11  6       2 non-null      float64
 12  8       2 non-null      float64
 13  9       2 non-null      float64
 14  12      2 non-null      float64
 15  14      2 non-null      float64
 16  15      2 non-null      float64
 17  19      2 non-null      float64
 18  22      2 non-null      float64
dtypes: float64(10), int64(9)
memory usage: 320.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_9
1056265,11050,2020-11-10 17:49:55,model_1,04.16.3553,9,V-21002,17
2553028,12635,2020-11-30 10:51:51,model_0,04.22.1778,9,V-21008,10
3028221,13073,2020-11-08 17:24:38,model_0,04.22.1750,9,V-21008,17
3124705,13204,2020-11-02 16:48:23,model_0,04.22.1750,9,V-21005,16
3124735,13204,2020-11-03 13:03:42,model_0,04.22.1750,9,V-21005,13
3124789,13204,2020-11-03 20:51:56,model_0,04.22.1750,9,V-21005,20
3124813,13204,2020-11-03 20:56:42,model_0,04.22.1750,9,V-21005,20
3210037,13300,2020-11-02 13:08:11,model_0,04.22.1750,9,V-21008,13
3967638,14083,2020-11-10 16:24:09,model_3,05.15.2138,9,1,16
4058740,14178,2020-11-05 19:02:45,model_0,04.22.1750,9,C-14014,19
4058742,14178,2020-11-05 19:02:49,model_0,04.22.1750,9,C-14014,19
4058744,14178,2020-11-05 19:02:57,model_0,04.22.1750,9,C-14014,19
4058745,14178,2020-11-05 19:03:04,model_0,04.22.1750,9,C-14014,19
4058747,14178,2020-11-05 19:03:17,model_0,04.22.1750,9,C-14014,19
4295814,14414,2020-11-10 18:55:13,model_3,05.15.2138,9,1,18
4314669,14438,2020-11-23 19:33:05,model_1,04.16.3553,9,V-21002,19
4398696,14495,2020-11-04 18:13:35,model_1,04.16.3553,9,V-21002,18
4766587,14777,2020-11-26 13:01:04,model_0,04.22.1778,9,V-21008,13
4766662,14777,2020-11-30 15:44:36,model_0,04.22.1778,9,V-21005,15
4824030,14848,2020-11-09 18:38:37,model_1,04.16.3553,9,V-21002,18
4898996,14887,2020-11-27 10:24:38,model_0,04.22.1778,9,V-21008,10
5279340,15302,2020-11-20 13:07:18,model_0,04.22.1778,9,C-14014,13
5320654,15344,2020-11-27 02:53:16,model_0,04.22.1778,9,V-21008,2
5555902,15569,2020-11-28 18:55:00,model_0,04.22.1778,9,V-21008,18
5627880,15575,2020-11-25 14:09:04,model_2,04.33.1261,9,C-12032,14
5967922,15893,2020-11-06 13:41:28,model_1,04.16.3553,9,V-21002,13
5968463,15893,2020-11-10 19:16:53,model_1,04.16.3553,9,V-21002,19
6624513,16457,2020-11-09 16:53:32,model_2,04.33.1185,9,V-21008,16
7518094,17322,2020-11-27 20:30:31,model_0,04.22.1778,9,V-21008,20
7518151,17322,2020-11-29 18:32:37,model_0,04.22.1778,9,V-21008,18
7518174,17322,2020-11-30 15:18:11,model_0,04.22.1778,9,V-21008,15
8193203,18082,2020-11-19 12:33:04,model_0,04.22.1750,9,V-21004,12
8319911,18212,2020-11-28 19:29:57,model_1,04.16.3553,9,C-13039,19
8438999,18308,2020-11-30 09:02:21,model_0,04.22.1778,9,V-21008,9
8439016,18308,2020-11-30 21:20:28,model_0,04.22.1778,9,V-21008,21
8727842,18580,2020-11-16 23:14:07,model_2,04.33.1261,9,V-21005,23
9249179,19126,2020-11-19 23:06:26,model_3,05.15.2138,9,1,23
9740227,19646,2020-11-24 19:02:35,model_1,04.16.3553,9,V-21002,19
11448220,21106,2020-11-29 13:57:20,model_2,04.33.1261,9,V-21008,13
11744530,21375,2020-11-28 01:12:02,model_0,04.22.1778,9,V-21008,1
11753190,21382,2020-11-26 22:19:56,model_0,04.22.1778,9,V-21008,22
12450373,22167,2020-11-30 13:12:03,model_2,04.33.1261,9,V-21008,13
13297193,22970,2020-11-26 20:10:13,model_0,04.22.1778,9,V-21005,20
13297210,22970,2020-11-26 20:14:08,model_0,04.22.1778,9,V-21005,20
13297228,22970,2020-11-26 20:17:17,model_0,04.22.1778,9,V-21005,20
13672703,23407,2020-11-19 01:44:18,model_2,04.33.1261,9,C-12032,1
13891945,23652,2020-11-16 21:23:39,model_1,04.16.3553,9,V-21002,21
14215877,23981,2020-11-09 08:42:56,model_1,04.16.3553,9,V-21002,8
14218388,23981,2020-11-28 17:47:33,model_1,04.16.3553,9,V-21002,17
14233607,23999,2020-11-10 18:22:29,model_0,04.22.1750,9,C-14014,18
14233635,23999,2020-11-11 21:34:30,model_0,04.22.1750,9,C-14014,21
14245144,24004,2020-11-29 23:35:53,model_0,04.22.1778,9,V-21008,23
14572746,24312,2020-11-07 17:27:10,model_1,04.16.3553,9,V-21002,17
15333579,24964,2020-11-15 20:18:25,model_1,04.16.3553,9,V-21008,20

,1,2,8,9,10,12,13,14,15,16,17,18,19,20,21,22,23,0,4,5,6,7,11
err_p9,2,1.0,1,1.0,2,1,7,1,2,3,4,6,9,7,3.0,1.0,3,NaN,NaN,NaN,NaN,NaN,NaN
err_np9,2,NaN,1,NaN,2,3,10,1,3,2,1,5,3,7,NaN,NaN,1,1.0,1.0,2.0,3.0,1.0,6.0

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p9 to err_np9
Data columns (total 23 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       2 non-null      int64
 1   2       2 non-null      float64
 2   8       2 non-null      int64
 3   9       2 non-null      float64
 4   10      2 non-null      int64
 5   12      2 non-null      int64
 6   13      2 non-null      int64
 7   14      2 non-null      int64
 8   15      2 non-null      int64
 9   16      2 non-null      int64
 10  17      2 non-null      int64
 11  18      2 non-null      int64
 12  19      2 non-null      int64
 13  20      2 non-null      int64
 14  21      2 non-null      float64
 15  22      2 non-null      float64
 16  23      2 non-null      int64
 17  0       2 non-null      float64
 18  4       2 non-null      float64
 19  5       2 non-null      float64
 20  6       2 non-null      float64
 21  7       2 non-null      float64
 22  11      2 non-null      float64
dtypes: float64(10), int64(13)
memory usage: 384.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_10
4363,10005,2020-11-16 14:03:45,model_0,04.22.1750,10,1,14
15815,10013,2020-11-02 02:54:21,model_0,04.22.1750,10,1,2
15820,10013,2020-11-02 02:55:44,model_0,04.22.1750,10,1,2
15823,10013,2020-11-02 02:56:20,model_0,04.22.1750,10,1,2
15826,10013,2020-11-02 02:57:20,model_0,04.22.1750,10,1,2
...,...,...,...,...,...,...,...
15337589,24964,2020-11-29 16:13:32,model_1,04.16.3553,10,1,16
15337592,24964,2020-11-29 16:13:34,model_1,04.16.3553,10,1,16
15337597,24964,2020-11-29 16:13:37,model_1,04.16.3553,10,1,16
15337609,24964,2020-11-29 17:29:31,model_1,04.16.3553,10,1,17
15337616,24964,2020-11-29 17:29:45,model_1,04.16.3553,10,1,17

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p10,2267,1722,1586,1879,1771,1651,1722,1648,1771,1628,1744,1625,1752,1944,1709,1433,1692,1526,1486,2201,2006,1933,1751,2176
err_np10,1283,1146,1056,983,906,950,845,1016,1010,1083,1004,999,908,1012,984,1020,1041,1092,1206,1251,1285,1434,1459,1236

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p10 to err_np10
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_11
320,10001,2020-11-01 02:04:21,model_2,04.33.1185,11,1,2
448,10001,2020-11-05 04:03:19,model_2,04.33.1185,11,1,4
618,10001,2020-11-10 02:15:13,model_2,04.33.1185,11,1,2
689,10001,2020-11-12 03:06:35,model_2,04.33.1261,11,1,3
783,10001,2020-11-15 14:22:08,model_2,04.33.1261,11,1,14
...,...,...,...,...,...,...,...
15367396,24998,2020-11-20 05:08:30,model_0,04.22.1778,11,1,5
15367410,24998,2020-11-23 02:24:44,model_0,04.22.1778,11,1,2
15367416,24998,2020-11-25 02:04:50,model_0,04.22.1778,11,1,2
15367421,24998,2020-11-27 05:08:31,model_0,04.22.1778,11,1,5
15367430,24998,2020-11-29 05:08:30,model_0,04.22.1778,11,1,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p11,2430,2178,15533,16494,17568,10715,2730,3357,3598,3279,3269,3060,3145,3455,3149,3043,3513,3554,3766,4198,3826,3493,3114,2684
err_np11,2167,1783,29642,32332,32929,18244,2769,3552,3418,3397,3211,3082,3024,3070,3068,3299,3530,4284,4603,4459,4189,3978,3472,2552

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p11 to err_np11
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_12
319,10001,2020-11-01 02:04:21,model_2,04.33.1185,12,1,2
449,10001,2020-11-05 04:03:20,model_2,04.33.1185,12,1,4
452,10001,2020-11-05 04:06:13,model_2,04.33.1185,12,1,4
617,10001,2020-11-10 02:15:13,model_2,04.33.1185,12,1,2
688,10001,2020-11-12 03:06:35,model_2,04.33.1261,12,1,3
...,...,...,...,...,...,...,...
15367397,24998,2020-11-20 05:08:30,model_0,04.22.1778,12,1,5
15367409,24998,2020-11-23 02:24:44,model_0,04.22.1778,12,1,2
15367415,24998,2020-11-25 02:04:50,model_0,04.22.1778,12,1,2
15367422,24998,2020-11-27 05:08:31,model_0,04.22.1778,12,1,5
15367429,24998,2020-11-29 05:08:30,model_0,04.22.1778,12,1,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p12,2493,2378,15766,16717,17814,11165,3165,3745,3802,3514,3558,3393,3391,3760,3425,3350,3801,3883,4074,4516,4130,3766,3406,2957
err_np12,2308,1926,29900,32606,33213,19005,3398,4279,3713,3604,3420,3275,3191,3311,3326,3593,3771,4521,4857,4690,4405,4218,3640,2708

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p12 to err_np12
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_13
453,10001,2020-11-05 04:06:13,model_2,04.33.1185,13,1,4
3263,10004,2020-11-01 02:46:47,model_0,04.22.1750,13,1,2
3546,10004,2020-11-11 05:53:49,model_0,04.22.1750,13,1,5
3678,10004,2020-11-18 06:35:42,model_0,04.22.1750,13,1,6
18440,10013,2020-11-03 03:01:38,model_0,04.22.1750,13,1,3
...,...,...,...,...,...,...,...
15359818,24984,2020-11-30 07:56:38,model_1,04.16.3553,13,1,7
15359827,24984,2020-11-30 09:42:33,model_1,04.16.3553,13,1,9
15366889,24997,2020-11-17 01:54:53,model_0,04.22.1750,13,1,1
15367067,24997,2020-11-23 09:37:28,model_0,04.22.1778,13,1,9
15367072,24997,2020-11-23 09:39:16,model_0,04.22.1778,13,1,9

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p13,220,191,221,217,214,416,403,374,196,248,290,277,227,286,234,247,238,303,292,284,266,276,272,256
err_np13,131,121,222,240,263,679,540,635,145,155,174,155,145,181,172,218,205,206,223,197,176,186,147,159

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p13 to err_np13
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_14
334,10001,2020-11-02 02:01:59,model_2,04.33.1185,14,14,2
454,10001,2020-11-05 04:06:19,model_2,04.33.1185,14,13,4
485,10001,2020-11-05 22:27:23,model_2,04.33.1185,14,14,22
777,10001,2020-11-15 14:21:23,model_2,04.33.1261,14,14,14
778,10001,2020-11-15 14:21:27,model_2,04.33.1261,14,14,14
...,...,...,...,...,...,...,...
15359819,24984,2020-11-30 07:56:38,model_1,04.16.3553,14,13,7
15359829,24984,2020-11-30 09:42:38,model_1,04.16.3553,14,13,9
15359883,24984,2020-11-30 12:46:58,model_1,04.16.3553,14,14,12
15366893,24997,2020-11-17 01:54:59,model_0,04.22.1750,14,13,1
15367424,24998,2020-11-27 16:53:12,model_0,04.22.1778,14,14,16

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p14,4109,3902,3515,3947,4143,4648,4471,4595,5050,4866,5440,6253,6480,7701,6233,5313,5535,4967,5129,6254,5844,4937,4757,4412
err_np14,4809,3749,4443,5483,5602,5504,5422,5984,4412,5633,4914,4527,4191,3700,4036,4912,4329,4489,4775,4722,4719,5813,5369,5174

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p14 to err_np14
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_15
316,10001,2020-11-01 02:04:15,model_2,04.33.1185,15,1,2
321,10001,2020-11-01 02:04:28,model_2,04.33.1185,15,1,2
339,10001,2020-11-02 10:30:18,model_2,04.33.1185,15,1,10
347,10001,2020-11-02 12:36:20,model_2,04.33.1185,15,1,12
353,10001,2020-11-02 16:16:14,model_2,04.33.1185,15,1,16
...,...,...,...,...,...,...,...
15367423,24998,2020-11-27 05:08:47,model_0,04.22.1778,15,1,5
15367425,24998,2020-11-29 05:07:49,model_0,04.22.1778,15,1,5
15367426,24998,2020-11-29 05:08:12,model_0,04.22.1778,15,1,5
15367428,24998,2020-11-29 05:08:16,model_0,04.22.1778,15,1,5
15367431,24998,2020-11-29 05:08:46,model_0,04.22.1778,15,1,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p15,28145,17110,40319,39695,39470,25099,11157,17767,26584,26178,23465,22362,23233,24378,23135,22874,23750,24706,25576,25260,25431,29674,30178,30303
err_np15,45604,28380,70593,69315,69683,42158,17733,28132,37392,35274,31495,29660,30741,31888,29971,29894,30134,32390,34330,35336,36232,44631,47067,48635

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p15 to err_np15
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_16
324,10001,2020-11-01 23:53:55,model_2,04.33.1185,16,1,23
335,10001,2020-11-02 09:36:52,model_2,04.33.1185,16,1,9
341,10001,2020-11-02 11:45:21,model_2,04.33.1185,16,1,11
349,10001,2020-11-02 16:10:44,model_2,04.33.1185,16,1,16
354,10001,2020-11-02 16:28:15,model_2,04.33.1185,16,1,16
...,...,...,...,...,...,...,...
15367374,24998,2020-11-15 12:30:14,model_0,04.22.1778,16,1,12
15367390,24998,2020-11-18 15:37:24,model_0,04.22.1778,16,1,15
15367399,24998,2020-11-21 20:40:11,model_0,04.22.1778,16,1,20
15367402,24998,2020-11-22 08:10:37,model_0,04.22.1778,16,1,8
15367432,24998,2020-11-30 13:26:04,model_0,04.22.1778,16,1,13

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p16,9605,6426,4798,4385,5550,9865,19084,32217,33857,27725,23234,21737,23511,22992,22255,24099,29132,33988,35573,32666,28132,26059,21628,14583
err_np16,15609,10092,7527,6938,9379,16397,29384,46355,45607,36878,30842,29008,30728,29577,28894,31401,37408,46434,51734,50153,43989,42051,34883,23773

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p16 to err_np16
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_17
4736,10006,2020-11-02 00:29:14,model_1,04.16.3553,17,13,0
4745,10006,2020-11-02 09:59:05,model_1,04.16.3553,17,14,9
4790,10006,2020-11-08 20:06:43,model_1,04.16.3553,17,14,20
4893,10006,2020-11-13 13:47:44,model_1,04.16.3553,17,14,13
4959,10006,2020-11-14 11:01:56,model_1,04.16.3553,17,14,11
...,...,...,...,...,...,...,...
15357061,24984,2020-11-14 08:59:56,model_1,04.16.3553,17,14,8
15357296,24984,2020-11-16 09:38:36,model_1,04.16.3553,17,14,9
15358541,24984,2020-11-22 09:28:36,model_1,04.16.3553,17,14,9
15359083,24984,2020-11-25 09:36:07,model_1,04.16.3553,17,14,9
15359678,24984,2020-11-29 09:13:42,model_1,04.16.3553,17,14,9

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p17,610,226,149,159,237,524,1150,2205,2065,1430,1067,990,759,649,583,777,862,785,1014,1162,1077,1119,949,645
err_np17,660,313,243,370,332,627,1515,2375,2189,1621,1049,867,790,845,766,759,795,935,1231,1438,1329,1510,1308,863

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p17 to err_np17
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_18
737,10001,2020-11-14 11:25:24,model_2,04.33.1261,18,1,11
745,10001,2020-11-14 11:28:19,model_2,04.33.1261,18,1,11
2580,10001,2020-11-29 02:00:33,model_2,04.33.1261,18,1,2
2583,10001,2020-11-29 02:01:14,model_2,04.33.1261,18,1,2
22391,10014,2020-11-27 10:30:20,model_2,04.33.1261,18,1,10
...,...,...,...,...,...,...,...
15321586,24948,2020-11-17 16:28:55,model_0,04.22.1750,18,1,16
15321665,24948,2020-11-19 13:18:32,model_0,04.22.1750,18,1,13
15324574,24951,2020-11-26 14:31:25,model_0,04.22.1778,18,1,14
15341341,24967,2020-11-21 14:00:51,model_2,04.33.1261,18,1,14
15354513,24983,2020-11-24 09:50:48,model_0,04.22.1750,18,1,9

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p18,11,16,10,3,3,2,14,14,59,132,251,199,127,230,191,182,183,185,140,111,90,48,70,68
err_np18,12,6,2,1,1,3,2,5,8,15,33,19,28,18,23,31,17,27,18,21,16,11,9,6

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p18 to err_np18
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_19
742,10001,2020-11-14 11:27:42,model_2,04.33.1261,19,1,11
59166,10055,2020-11-16 12:33:58,model_1,04.16.3553,19,1,12
106249,10102,2020-11-19 13:06:20,model_1,04.16.3571,19,1,13
106274,10102,2020-11-20 10:57:51,model_1,04.16.3571,19,1,10
118263,10119,2020-11-20 02:35:21,model_1,04.16.3571,19,1,2
...,...,...,...,...,...,...,...
15052489,24747,2020-11-09 23:11:39,model_1,04.16.3553,19,1,23
15079585,24779,2020-11-30 20:24:05,model_2,04.33.1261,19,1,20
15178629,24888,2020-11-11 22:47:51,model_3,05.15.2138,19,1,22
15178718,24888,2020-11-14 11:09:07,model_3,05.15.2138,19,1,11
15313688,24935,2020-11-27 17:36:51,model_2,04.33.1261,19,1,17

,0,1,2,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,3
err_p19,8,6,4.0,1.0,1,12.0,5,26,24,30,30,26,35,30,28,30.0,45,36,55,35,26,35,26,NaN
err_np19,8,6,NaN,NaN,3,NaN,1,2,9,6,4,6,1,1,10,NaN,7,9,10,11,3,7,5,1.0

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p19 to err_np19
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      float64
 3   4       2 non-null      float64
 4   5       2 non-null      int64
 5   6       2 non-null      float64
 6   7       2 non-null      int64
 7   8       2 non-null      int64
 8   9       2 non-null      int64
 9   10      2 non-null      int64
 10  11      2 non-null      int64
 11  12      2 non-null      int64
 12  13      2 non-null      int64
 13  14      2 non-null      int64
 14  15      2 non-null      int64
 15  16      2 non-null      float64
 16  17      2 non-null      int64
 17  18      2 non-null      int64
 18  19      2 non-null      int64
 19  20      2 non-null      int64
 20  21      2 non-null      int64
 21  22      2 non-null      int64
 22  23      2 non-null      int64
 23  3       2 non-null      float64
dtypes: float64(5), int64(19)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_20
738,10001,2020-11-14 11:25:39,model_2,04.33.1261,20,1,11
746,10001,2020-11-14 11:28:31,model_2,04.33.1261,20,1,11
2584,10001,2020-11-29 02:01:26,model_2,04.33.1261,20,1,2
22392,10014,2020-11-27 10:30:29,model_2,04.33.1261,20,1,10
67332,10067,2020-11-06 17:15:01,model_2,04.33.1185,20,1,17
...,...,...,...,...,...,...,...
15321587,24948,2020-11-17 16:29:08,model_0,04.22.1750,20,1,16
15321666,24948,2020-11-19 13:18:44,model_0,04.22.1750,20,1,13
15324575,24951,2020-11-26 14:31:40,model_0,04.22.1778,20,1,14
15341342,24967,2020-11-21 14:00:58,model_2,04.33.1261,20,1,14
15354515,24983,2020-11-24 09:50:58,model_0,04.22.1750,20,1,9

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p20,10,7,6,3,2,1,6,7,39,100,196,160,97,183,146,159,136,152,108,85,64,39,54,49
err_np20,11,6,2,1,1,3,1,2,7,14,26,14,19,17,19,25,13,22,16,15,15,7,8,7

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p20 to err_np20
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_21
743,10001,2020-11-14 11:27:42,model_2,04.33.1261,21,1,11
59167,10055,2020-11-16 12:33:58,model_1,04.16.3553,21,1,12
106250,10102,2020-11-19 13:06:20,model_1,04.16.3571,21,1,13
106275,10102,2020-11-20 10:57:51,model_1,04.16.3571,21,1,10
118262,10119,2020-11-20 02:35:21,model_1,04.16.3571,21,1,2
...,...,...,...,...,...,...,...
14929965,24620,2020-11-24 06:48:49,model_0,04.22.1778,21,1,6
14979951,24670,2020-11-06 13:19:05,model_1,04.16.3553,21,1,13
15052490,24747,2020-11-09 23:11:39,model_1,04.16.3553,21,1,23
15079586,24779,2020-11-30 20:24:05,model_2,04.33.1261,21,1,20
15313689,24935,2020-11-27 17:36:51,model_2,04.33.1261,21,1,17

,0,1,2,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,3
err_p21,8,6,4.0,1.0,1,5.0,5,26.0,24,25,25,24,30,28,27,27.0,39,32,52,33,26,32,26,NaN
err_np21,8,6,NaN,NaN,3,NaN,1,NaN,8,5,3,6,1,1,9,NaN,6,9,9,10,3,7,5,1.0

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p21 to err_np21
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      float64
 3   4       2 non-null      float64
 4   5       2 non-null      int64
 5   6       2 non-null      float64
 6   7       2 non-null      int64
 7   8       2 non-null      float64
 8   9       2 non-null      int64
 9   10      2 non-null      int64
 10  11      2 non-null      int64
 11  12      2 non-null      int64
 12  13      2 non-null      int64
 13  14      2 non-null      int64
 14  15      2 non-null      int64
 15  16      2 non-null      float64
 16  17      2 non-null      int64
 17  18      2 non-null      int64
 18  19      2 non-null      int64
 19  20      2 non-null      int64
 20  21      2 non-null      int64
 21  22      2 non-null      int64
 22  23      2 non-null      int64
 23  3       2 non-null      float64
dtypes: float64(6), int64(18)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_22
322,10001,2020-11-01 02:04:30,model_2,04.33.1185,22,1,2
450,10001,2020-11-05 04:03:26,model_2,04.33.1185,22,1,4
489,10001,2020-11-06 02:54:40,model_2,04.33.1185,22,1,2
619,10001,2020-11-10 02:15:16,model_2,04.33.1185,22,1,2
658,10001,2020-11-11 02:16:03,model_2,04.33.1185,22,1,2
...,...,...,...,...,...,...,...
15367312,24998,2020-11-05 05:00:12,model_0,04.22.1778,22,1,5
15367322,24998,2020-11-07 05:08:42,model_0,04.22.1778,22,1,5
15367329,24998,2020-11-09 05:08:43,model_0,04.22.1778,22,1,5
15367337,24998,2020-11-10 18:46:13,model_0,04.22.1778,22,1,18
15367345,24998,2020-11-10 18:48:10,model_0,04.22.1778,22,1,18

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p22,33470,27630,41394,40912,39844,29095,21080,27218,34617,37319,37706,36427,37384,38049,37901,37519,39900,44796,51774,59015,59666,55695,51818,43552
err_np22,34090,27032,53256,52390,51033,32854,18391,22884,29750,30028,29227,29658,31119,32076,30182,31795,33111,36511,42746,49333,53116,54323,50837,43972

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p22 to err_np22
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_23
720,10001,2020-11-13 04:14:08,model_2,04.33.1261,23,standby,4
734,10001,2020-11-14 11:25:15,model_2,04.33.1261,23,active,11
735,10001,2020-11-14 11:25:17,model_2,04.33.1261,23,active,11
741,10001,2020-11-14 11:27:39,model_2,04.33.1261,23,active,11
759,10001,2020-11-14 16:08:17,model_2,04.33.1261,23,standby,16
...,...,...,...,...,...,...,...
15367200,24997,2020-11-27 12:38:37,model_0,04.22.1778,23,active,12
15367238,24997,2020-11-28 21:06:57,model_0,04.22.1778,23,active,21
15367249,24997,2020-11-29 03:12:26,model_0,04.22.1778,23,standby,3
15367276,24997,2020-11-29 19:27:56,model_0,04.22.1778,23,active,19
15367338,24998,2020-11-10 18:46:15,model_0,04.22.1778,23,active,18

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p23,46864,37765,36187,35273,32751,28591,28621,37792,48539,51928,52254,50162,52288,52792,52073,51146,54120,59984,69120,80017,81609,77722,71565,60845
err_np23,44055,34897,34611,31742,28324,23114,22581,28019,37465,38009,37024,38483,40425,40948,38430,40864,42006,46357,54227,62905,68096,69801,65905,57715

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p23 to err_np23
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_24
1066,10001,2020-11-26 19:38:56,model_2,04.33.1261,24,1,19
1944,10001,2020-11-27 18:30:13,model_2,04.33.1261,24,1,18
1955,10001,2020-11-27 18:43:49,model_2,04.33.1261,24,1,18
2533,10001,2020-11-27 22:46:51,model_2,04.33.1261,24,1,22
2573,10001,2020-11-29 00:06:21,model_2,04.33.1261,24,1,0
...,...,...,...,...,...,...,...
15324537,24951,2020-11-25 09:09:56,model_0,04.22.1778,24,1,9
15327551,24955,2020-11-26 12:10:59,model_2,04.33.1261,24,1,12
15327653,24956,2020-11-01 13:16:17,model_3,05.15.2138,24,1,13
15328052,24956,2020-11-28 00:19:40,model_3,05.15.2138,24,1,0
15350947,24977,2020-11-17 13:17:20,model_1,04.16.3553,24,1,13

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p24,548,403,430,444,527,394,437,776,826,754,648,763,724,732,711,755,948,818,1064,1209,988,1073,1004,666
err_np24,941,778,802,708,793,696,670,683,762,742,666,812,936,877,692,808,837,1075,1195,1216,1192,1211,1167,1163

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p24 to err_np24
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_25
2582,10001,2020-11-29 02:00:48,model_2,04.33.1261,25,2,2
118325,10119,2020-11-21 11:36:30,model_1,04.16.3571,25,2,11
160795,10160,2020-11-22 12:28:55,model_2,04.33.1261,25,1,12
202357,10208,2020-11-17 18:43:24,model_0,04.22.1750,25,scanning timeout,18
202358,10208,2020-11-17 18:45:11,model_0,04.22.1750,25,scanning timeout,18
...,...,...,...,...,...,...,...
15188922,24902,2020-11-16 23:14:44,model_2,04.33.1261,25,1,23
15188923,24902,2020-11-16 23:15:49,model_2,04.33.1261,25,1,23
15188924,24902,2020-11-16 23:19:49,model_2,04.33.1261,25,1,23
15324572,24951,2020-11-26 14:29:59,model_0,04.22.1778,25,1,14
15324573,24951,2020-11-26 14:30:43,model_0,04.22.1778,25,1,14

,0,1,2,3,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p25,12,11,12,3.0,2,13,35,84,69,46,45,66,70,56,52,85,70,48,60,67,65,89
err_np25,6,2,3,NaN,2,7,1,2,10,5,8,6,8,5,12,17,3,5,6,5,9,2

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p25 to err_np25
Data columns (total 22 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      float64
 4   6       2 non-null      int64
 5   7       2 non-null      int64
 6   8       2 non-null      int64
 7   9       2 non-null      int64
 8   10      2 non-null      int64
 9   11      2 non-null      int64
 10  12      2 non-null      int64
 11  13      2 non-null      int64
 12  14      2 non-null      int64
 13  15      2 non-null      int64
 14  16      2 non-null      int64
 15  17      2 non-null      int64
 16  18      2 non-null      int64
 17  19      2 non-null      int64
 18  20      2 non-null      int64
 19  21      2 non-null      int64
 20  22      2 non-null      int64
 21  23      2 non-null      int64
dtypes: float64(1), int64(21)
memory usage: 368.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_26
323,10001,2020-11-01 23:53:55,model_2,04.33.1185,26,1,23
326,10001,2020-11-02 00:00:02,model_2,04.33.1185,26,1,0
367,10001,2020-11-03 00:18:15,model_2,04.33.1185,26,1,0
396,10001,2020-11-04 00:10:40,model_2,04.33.1185,26,1,0
457,10001,2020-11-05 12:30:12,model_2,04.33.1185,26,1,12
...,...,...,...,...,...,...,...
15367262,24997,2020-11-29 07:26:18,model_0,04.22.1778,26,1,7
15367282,24997,2020-11-30 07:45:52,model_0,04.22.1778,26,1,7
15367331,24998,2020-11-10 18:42:35,model_0,04.22.1778,26,1,18
15367349,24998,2020-11-10 18:57:17,model_0,04.22.1778,26,1,18
15367350,24998,2020-11-10 18:57:18,model_0,04.22.1778,26,1,18

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p26,54883,7520,3779,3004,3793,6912,13062,20709,17845,11499,7278,5275,4479,3852,3210,3263,3831,4493,5379,4895,3995,3185,2355,1377
err_np26,89609,13534,6428,5117,6583,11949,20638,30566,25943,17383,11341,8396,7559,5961,5176,5270,5953,8245,10178,10544,8675,7381,5474,3222

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p26 to err_np26
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_27
4432,10005,2020-11-19 02:09:18,model_0,04.22.1750,27,1,2
23439,10019,2020-11-03 17:02:27,model_3,05.15.2138,27,1,17
23443,10019,2020-11-03 18:38:03,model_3,05.15.2138,27,1,18
23451,10019,2020-11-03 18:38:53,model_3,05.15.2138,27,1,18
23462,10019,2020-11-03 19:53:46,model_3,05.15.2138,27,1,19
...,...,...,...,...,...,...,...
15365127,24990,2020-11-29 18:34:17,model_4,03.11.1167,27,1,18
15365132,24990,2020-11-29 21:27:09,model_4,03.11.1167,27,1,21
15365133,24990,2020-11-29 21:27:10,model_4,03.11.1167,27,1,21
15365134,24990,2020-11-29 21:27:11,model_4,03.11.1167,27,1,21
15365136,24990,2020-11-29 21:27:16,model_4,03.11.1167,27,1,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p27,2024,1912,2243,2584,2921,3108,2818,3522,3723,4338,4314,5211,4807,5169,4563,4591,4134,4114,6323,7086,4089,3339,2593,2383
err_np27,4406,3553,5013,5442,5193,5005,4303,5245,4176,5005,5331,4044,5016,5524,5013,5473,4984,5447,4975,5678,5544,5204,4628,4020

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p27 to err_np27
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_28
4431,10005,2020-11-19 02:09:17,model_0,04.22.1750,28,1,2
23440,10019,2020-11-03 17:02:27,model_3,05.15.2138,28,1,17
23445,10019,2020-11-03 18:38:03,model_3,05.15.2138,28,1,18
23452,10019,2020-11-03 18:38:53,model_3,05.15.2138,28,1,18
23463,10019,2020-11-03 19:53:46,model_3,05.15.2138,28,1,19
...,...,...,...,...,...,...,...
15365124,24990,2020-11-29 18:34:10,model_4,03.11.1167,28,1,18
15365126,24990,2020-11-29 18:34:14,model_4,03.11.1167,28,1,18
15365128,24990,2020-11-29 18:34:18,model_4,03.11.1167,28,1,18
15365131,24990,2020-11-29 21:27:08,model_4,03.11.1167,28,1,21
15365135,24990,2020-11-29 21:27:15,model_4,03.11.1167,28,1,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p28,2041,1930,2277,2671,2997,3174,2875,3636,3883,4482,4461,5341,4985,5262,4693,4770,4384,4351,6555,7379,4171,3417,2691,2448
err_np28,4515,3597,5022,5487,5306,5088,4425,5362,4228,5123,5395,4079,5068,5638,5105,5650,5135,5509,5147,5759,5655,5278,4782,4111

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p28 to err_np28
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_30
421147,10455,2020-11-05 14:23:36,model_0,04.22.1750,30,4,14
502264,10568,2020-11-06 09:24:58,model_2,04.33.1185,30,4,9
584211,10633,2020-11-23 17:39:11,model_2,04.33.1261,30,4,17
714794,10734,2020-11-25 20:03:05,model_2,04.33.1261,30,4,20
723540,10749,2020-11-20 13:09:14,model_1,04.16.3571,30,4,13
...,...,...,...,...,...,...,...
14837830,24559,2020-11-09 22:04:21,model_1,04.16.3553,30,4,22
14842511,24563,2020-11-04 16:16:05,model_2,04.33.1185,30,4,16
14905527,24608,2020-11-24 22:19:07,model_1,04.16.3553,30,4,22
15040013,24734,2020-11-16 16:29:55,model_3,05.15.2138,30,0,16
15042064,24735,2020-11-27 20:21:31,model_0,04.22.1778,30,3,20

,6,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p30,1.0,1.0,23,21,18,19,33,21,22,26,20,12.0,17,13.0,11.0,16,7
err_np30,NaN,NaN,9,15,17,7,7,17,16,16,13,NaN,1,NaN,NaN,2,1

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p30 to err_np30
Data columns (total 17 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   6       2 non-null      float64
 1   8       2 non-null      float64
 2   9       2 non-null      int64
 3   10      2 non-null      int64
 4   11      2 non-null      int64
 5   12      2 non-null      int64
 6   13      2 non-null      int64
 7   14      2 non-null      int64
 8   15      2 non-null      int64
 9   16      2 non-null      int64
 10  17      2 non-null      int64
 11  18      2 non-null      float64
 12  19      2 non-null      int64
 13  20      2 non-null      float64
 14  21      2 non-null      float64
 15  22      2 non-null      int64
 16  23      2 non-null      int64
dtypes: float64(5), int64(12)
memory usage: 288.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_31
317,10001,2020-11-01 02:04:15,model_2,04.33.1185,31,1,2
325,10001,2020-11-01 23:54:16,model_2,04.33.1185,31,0,23
336,10001,2020-11-02 09:36:52,model_2,04.33.1185,31,1,9
337,10001,2020-11-02 09:37:13,model_2,04.33.1185,31,0,9
342,10001,2020-11-02 11:45:22,model_2,04.33.1185,31,1,11
...,...,...,...,...,...,...,...
15367391,24998,2020-11-18 15:37:43,model_0,04.22.1778,31,0,15
15367400,24998,2020-11-21 20:40:30,model_0,04.22.1778,31,0,20
15367403,24998,2020-11-22 08:10:37,model_0,04.22.1778,31,1,8
15367404,24998,2020-11-22 08:10:56,model_0,04.22.1778,31,0,8
15367433,24998,2020-11-30 13:26:24,model_0,04.22.1778,31,0,13

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p31,19634,13555,16184,15274,16022,17180,25500,45153,50545,44755,38715,36759,39793,39736,38408,41292,48358,55652,57827,52556,45747,44042,37782,27675
err_np31,28343,19663,26677,26171,27884,28474,36928,59541,60715,51563,44156,43328,46133,44751,45011,48305,56625,67950,73092,70005,61800,60109,51897,37772

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p31 to err_np31
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_32
5494,10009,2020-11-01 22:33:49,model_1,04.16.3553,32,80,22
5495,10009,2020-11-01 22:34:19,model_1,04.16.3553,32,79,22
5496,10009,2020-11-01 22:35:19,model_1,04.16.3553,32,80,22
5497,10009,2020-11-01 22:40:49,model_1,04.16.3553,32,79,22
5498,10009,2020-11-01 22:41:19,model_1,04.16.3553,32,80,22
...,...,...,...,...,...,...,...
15359602,24984,2020-11-28 23:19:48,model_1,04.16.3553,32,79,23
15359649,24984,2020-11-29 04:31:55,model_1,04.16.3553,32,80,4
15359653,24984,2020-11-29 04:35:24,model_1,04.16.3553,32,79,4
15359815,24984,2020-11-30 01:01:33,model_1,04.16.3553,32,80,1
15359816,24984,2020-11-30 01:23:03,model_1,04.16.3553,32,79,1

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p32,25358,25853,22728,24729,20515,18460,16675,17890,20250,19969,19536,19216,21436,22788,21360,23325,23914,24092,23624,24949,25195,25995,25056,25156
err_np32,27321,28338,26495,28596,23915,21187,20400,21829,22191,20947,21067,22390,22799,23170,23825,23791,25514,24884,24929,25924,27403,28751,28776,27736

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p32 to err_np32
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_33
318,10001,2020-11-01 02:04:15,model_2,04.33.1185,33,2,2
446,10001,2020-11-05 04:03:14,model_2,04.33.1185,33,2,4
614,10001,2020-11-10 02:15:08,model_2,04.33.1185,33,2,2
685,10001,2020-11-12 03:06:17,model_2,04.33.1261,33,3,3
779,10001,2020-11-15 14:22:00,model_2,04.33.1261,33,3,14
...,...,...,...,...,...,...,...
15367394,24998,2020-11-20 05:08:12,model_0,04.22.1778,33,2,5
15367407,24998,2020-11-23 02:24:27,model_0,04.22.1778,33,2,2
15367412,24998,2020-11-25 02:04:32,model_0,04.22.1778,33,2,2
15367419,24998,2020-11-27 05:08:13,model_0,04.22.1778,33,2,5
15367427,24998,2020-11-29 05:08:13,model_0,04.22.1778,33,2,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p33,471,361,11605,12335,12925,7228,927,1518,1452,1435,1345,1224,1167,1322,1227,1387,1511,1778,1921,1656,1478,1183,1094,751
err_np33,627,456,20682,22154,22810,12266,1380,1994,1796,1706,1505,1411,1487,1404,1411,1527,1751,2285,2365,2151,1835,1686,1393,888

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p33 to err_np33
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_34
345,10001,2020-11-02 11:50:28,model_2,04.33.1185,34,4,11
378,10001,2020-11-03 11:20:57,model_2,04.33.1185,34,4,11
539,10001,2020-11-08 19:01:17,model_2,04.33.1185,34,4,19
541,10001,2020-11-08 19:26:18,model_2,04.33.1185,34,4,19
550,10001,2020-11-08 22:37:47,model_2,04.33.1185,34,4,22
...,...,...,...,...,...,...,...
15366584,24997,2020-11-04 20:14:46,model_0,04.22.1750,34,3,20
15366585,24997,2020-11-04 20:16:47,model_0,04.22.1750,34,1,20
15366588,24997,2020-11-04 20:18:21,model_0,04.22.1750,34,1,20
15367333,24998,2020-11-10 18:45:10,model_0,04.22.1778,34,4,18
15367336,24998,2020-11-10 18:46:08,model_0,04.22.1778,34,1,18

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p34,2370,1812,946,912,853,934,2388,3321,3880,3777,4272,4155,4505,4459,3511,3247,4317,3886,5501,6612,6568,5043,4310,3573
err_np34,974,451,193,207,204,256,363,895,1524,1469,1316,1164,1272,1357,1332,1359,1619,1916,2357,2528,2750,1881,1396,898

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p34 to err_np34
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_35
4367,10005,2020-11-16 14:03:50,model_0,04.22.1750,35,1,14
4433,10005,2020-11-19 02:09:39,model_0,04.22.1750,35,1,2
4434,10005,2020-11-19 02:22:43,model_0,04.22.1750,35,1,2
4829,10006,2020-11-09 21:16:42,model_1,04.16.3553,35,1,21
46350,10047,2020-11-09 10:16:00,model_2,04.33.1185,35,1,10
...,...,...,...,...,...,...,...
15337602,24964,2020-11-29 16:13:40,model_1,04.16.3553,35,1,16
15337612,24964,2020-11-29 17:29:38,model_1,04.16.3553,35,1,17
15341292,24967,2020-11-19 17:42:26,model_1,04.16.3553,35,1,17
15341297,24967,2020-11-19 17:44:36,model_1,04.16.3553,35,1,17
15359830,24984,2020-11-30 09:42:39,model_1,04.16.3553,35,1,9

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p35,259,157,212,157,57,70,78,112,175,302,380,417,362,454,385,384,368,447,387,435,525,428,487,351
err_np35,131,133,41,49,41,13,39,46,69,83,124,122,104,155,214,143,142,144,124,148,162,180,184,183

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p35 to err_np35
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_36
686,10001,2020-11-12 03:06:17,model_2,04.33.1261,36,8.0,3
3910,10004,2020-11-25 03:48:21,model_0,04.22.1778,36,8.0,3
4584,10005,2020-11-25 04:02:29,model_0,04.22.1778,36,8.0,4
4965,10006,2020-11-14 11:23:32,model_2,04.33.1261,36,8.0,11
5439,10008,2020-11-25 02:15:50,model_0,04.22.1778,36,8.0,2
...,...,...,...,...,...,...,...
15350054,24976,2020-11-18 20:35:39,model_1,04.16.3571,36,8.0,20
15350154,24976,2020-11-22 14:33:45,model_1,04.16.3553,36,8.0,14
15354543,24983,2020-11-26 03:02:45,model_0,04.22.1778,36,8.0,3
15366938,24997,2020-11-19 03:18:31,model_0,04.22.1778,36,8.0,3
15367301,24998,2020-11-03 05:13:29,model_0,04.22.1778,36,8.0,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p36,12,12,681,809,882,564,67,61,45,68,98,67,44,78,59,64,62,59,48,30,15,13,15,7
err_np36,26,8,1088,1311,1381,854,109,101,72,63,38,41,36,32,29,39,32,35,50,32,25,16,30,9

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p36 to err_np36
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_37
684,10001,2020-11-12 03:06:17,model_2,04.33.1261,37,0,3
3909,10004,2020-11-25 03:48:21,model_0,04.22.1778,37,0,3
4585,10005,2020-11-25 04:02:29,model_0,04.22.1778,37,0,4
4967,10006,2020-11-14 11:23:32,model_2,04.33.1261,37,0,11
5440,10008,2020-11-25 02:15:50,model_0,04.22.1778,37,0,2
...,...,...,...,...,...,...,...
15350056,24976,2020-11-18 20:35:39,model_1,04.16.3571,37,0,20
15350155,24976,2020-11-22 14:33:45,model_1,04.16.3553,37,0,14
15354542,24983,2020-11-26 03:02:45,model_0,04.22.1778,37,0,3
15366935,24997,2020-11-19 03:18:31,model_0,04.22.1778,37,0,3
15367303,24998,2020-11-03 05:13:29,model_0,04.22.1778,37,0,5

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p37,12,12,681,807,883,565,67,63,45,69,100,68,45,80,60,65,62,60,49,30,16,13,15,7
err_np37,26,8,1088,1310,1382,856,109,101,71,63,39,42,36,32,29,39,33,35,50,32,26,16,30,9

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p37 to err_np37
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_38
27127,10023,2020-11-13 13:53:44,model_1,04.16.3553,38,6467,13
27170,10023,2020-11-15 20:29:25,model_1,04.16.3553,38,4893,20
70439,10074,2020-11-17 11:17:28,model_2,04.33.1261,38,39391,11
80207,10079,2020-11-03 11:05:38,model_1,04.16.3553,38,3113,11
106193,10102,2020-11-18 22:32:19,model_1,04.16.3571,38,3065,22
...,...,...,...,...,...,...,...
15327050,24955,2020-11-08 03:10:30,model_1,04.16.3553,38,5807,3
15327280,24955,2020-11-15 12:56:46,model_2,04.33.1261,38,5666,12
15350199,24976,2020-11-23 20:59:05,model_1,04.16.3553,38,3210,20
15350316,24976,2020-11-29 20:33:15,model_1,04.16.3553,38,3246,20
15356972,24984,2020-11-13 00:32:04,model_1,04.16.3553,38,5759,0

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p38,96,46,43,35,36,48,51,88,69,98,107,105,91,104,79,103,137,144,153,165,155,164,133,99
err_np38,81,65,53,44,55,40,47,72,85,78,79,96,77,99,78,86,123,126,137,161,139,161,135,73

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p38 to err_np38
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_39
4282,10005,2020-11-13 12:36:32,model_0,04.22.1750,39,1,12
4283,10005,2020-11-13 12:36:54,model_0,04.22.1750,39,0,12
59218,10055,2020-11-18 20:40:27,model_2,04.33.1261,39,1,20
59219,10055,2020-11-18 20:41:11,model_2,04.33.1261,39,0,20
59374,10055,2020-11-24 10:52:03,model_2,04.33.1261,39,1,10
...,...,...,...,...,...,...,...
15189328,24902,2020-11-30 21:43:02,model_2,04.33.1261,39,0,21
15341452,24967,2020-11-27 21:48:48,model_2,04.33.1261,39,1,21
15341453,24967,2020-11-27 21:49:23,model_2,04.33.1261,39,0,21
15341454,24967,2020-11-27 21:51:15,model_2,04.33.1261,39,1,21
15341455,24967,2020-11-27 21:51:45,model_2,04.33.1261,39,0,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p39,589,463,380,256,230,207,138,257,268,238,266,329,242,239,298,383,452,276,344,373,432,582,771,806
err_np39,542,381,435,147,123,105,130,178,256,335,175,126,130,157,171,205,249,203,341,469,256,542,668,676

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p39 to err_np39
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_40
340,10001,2020-11-02 10:30:18,model_2,04.33.1185,40,1,10
343,10001,2020-11-02 11:45:22,model_2,04.33.1185,40,0,11
348,10001,2020-11-02 12:36:20,model_2,04.33.1185,40,1,12
350,10001,2020-11-02 16:10:44,model_2,04.33.1185,40,0,16
357,10001,2020-11-02 16:35:54,model_2,04.33.1185,40,1,16
...,...,...,...,...,...,...,...
15367356,24998,2020-11-10 18:58:32,model_0,04.22.1778,40,0,18
15367358,24998,2020-11-11 08:27:29,model_0,04.22.1778,40,1,8
15367360,24998,2020-11-11 13:16:31,model_0,04.22.1778,40,0,13
15367434,24998,2020-11-30 21:03:51,model_0,04.22.1778,40,1,21
15367435,24998,2020-11-30 21:04:20,model_0,04.22.1778,40,0,21

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p40,12117,8438,7168,4966,4891,6240,9879,14258,16441,15698,14220,13510,13222,13986,14260,14563,16351,18058,18922,19226,18521,19287,18147,15106
err_np40,16595,11718,9885,6476,6339,8020,11927,17820,19311,17955,16219,15146,15015,16141,15539,16511,17813,20773,22846,24510,23874,26257,25099,21019

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p40 to err_np40
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_41
327,10001,2020-11-02 00:22:24,model_2,04.33.1185,41,NFANDROID2,0
333,10001,2020-11-02 00:23:27,model_2,04.33.1185,41,NFANDROID2,0
338,10001,2020-11-02 09:57:19,model_2,04.33.1185,41,NFANDROID2,9
346,10001,2020-11-02 11:53:29,model_2,04.33.1185,41,NFANDROID2,11
365,10001,2020-11-02 21:57:34,model_2,04.33.1185,41,NFANDROID2,21
...,...,...,...,...,...,...,...
15366984,24997,2020-11-20 21:10:47,model_0,04.22.1778,41,NFANDROID2,21
15366985,24997,2020-11-20 21:10:48,model_0,04.22.1778,41,NFANDROID2,21
15366986,24997,2020-11-20 21:10:49,model_0,04.22.1778,41,NFANDROID2,21
15366987,24997,2020-11-20 22:59:07,model_0,04.22.1778,41,NFANDROID2,22
15366988,24997,2020-11-20 22:59:09,model_0,04.22.1778,41,NFANDROID2,22

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p41,1485,770,490,299,252,222,303,1003,1908,1991,1963,2158,2439,2544,2597,2371,2705,2793,3008,3245,3176,2947,2879,2080
err_np41,2319,1233,689,448,344,341,433,881,1518,1882,2224,2402,2553,2750,2578,2611,2783,2839,3489,4204,4167,4187,3796,3069

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p41 to err_np41
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

,user_id,time,model_nm,fwver,errtype,errcode,err_42
931,10001,2020-11-21 02:24:11,model_2,04.33.1261,42,3,2
3955,10004,2020-11-27 03:14:27,model_0,04.22.1778,42,3,3
3997,10004,2020-11-29 03:22:42,model_0,04.22.1778,42,3,3
4658,10005,2020-11-27 04:48:41,model_0,04.22.1778,42,3,4
4702,10005,2020-11-29 03:52:17,model_0,04.22.1778,42,3,3
...,...,...,...,...,...,...,...
15367004,24997,2020-11-21 03:58:00,model_0,04.22.1778,42,3,3
15367056,24997,2020-11-23 03:13:36,model_0,04.22.1778,42,3,3
15367129,24997,2020-11-25 03:01:11,model_0,04.22.1778,42,3,3
15367187,24997,2020-11-27 03:12:28,model_0,04.22.1778,42,3,3
15367251,24997,2020-11-29 03:12:36,model_0,04.22.1778,42,3,3

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23
err_p42,6,3,3009,3230,3444,1748,4,7,21,20,22,16,20,15,17,18,26,34,43,42,45,43,27,26
err_np42,11,7,6016,6223,6667,3109,6,11,12,20,16,19,14,11,12,20,20,29,34,43,40,30,22,19

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, err_p42 to err_np42
Data columns (total 24 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      int64
 1   1       2 non-null      int64
 2   2       2 non-null      int64
 3   3       2 non-null      int64
 4   4       2 non-null      int64
 5   5       2 non-null      int64
 6   6       2 non-null      int64
 7   7       2 non-null      int64
 8   8       2 non-null      int64
 9   9       2 non-null      int64
 10  10      2 non-null      int64
 11  11      2 non-null      int64
 12  12      2 non-null      int64
 13  13      2 non-null      int64
 14  14      2 non-null      int64
 15  15      2 non-null      int64
 16  16      2 non-null      int64
 17  17      2 non-null      int64
 18  18      2 non-null      int64
 19  19      2 non-null      int64
 20  20      2 non-null      int64
 21  21      2 non-null      int64
 22  22      2 non-null      int64
 23  23      2 non-null      int64
dtypes: int64(24)
memory usage: 400.0+ bytes

None

In [ ]:
tt = pd.concat(t).fillna(0)

tv = tt.T.corr()

tv1 = tv.loc[tv.index.str.contains('np')].iloc[:,::2]# iloc 로 컬럼들 problem 에대한 컬럼만 뽑는것
# print(tt.shape)
# [첫번째 인덱스: 마지막인덱스 :step] 으로 보면 된다 
d = []
for v in range(41):
    if v == 28:
        d.append(0)
        vv = tv1.iloc[v,v] # 하드 코드 느낌 하나라도 바뀌면 아주 아무것도 못써먹어
                            # 29번쨰 를 0부터 시작하니  28로 써 채워준것이다
    else:
        vv = tv1.iloc[v,v]
    d.append(vv)
display(d)
# 각각 불만 접수한사람과 안한사람 의 에러타입별 상관관계를 구한것이다
# 위 에 v== 28을 한이유가 밑에 꺼 돌아가게 하려고 만든것이다.
codf = pd.DataFrame(d).reset_index().rename(columns={'index':'errtype',0:'n_np_cor_hour_counts'})
codf['errtype']=codf['errtype']+1
codf
# 음이것으로 상관계수 식을 모르니 24시간을 나눠서 그걸로 상관계수를 구한게 어떻게 관계성이 높은지를 알수있게 되는지 
# 이해를 몬하것노 안되는거같에 근데 되겠지 
# 띠용 값이 다름 어떻게 값이 다를수가있지 뭐지 ?

[0.9962318654094494,
 0.3965072990350326,
 0.30877958922149706,
 0.7689093392844164,
 0.9718122825183706,
 -0.2351894551256699,
 0.4410490394571588,
 -0.012185275909275876,
 0.5668927848036025,
 0.4362701696875558,
 0.9986299135995451,
 0.9984941587998754,
 0.8300146419927472,
 -0.4811403172512371,
 0.9593349731626296,
 0.9812569589103155,
 0.9715329917736556,
 0.8700232456069996,
 0.5195870148719355,
 0.8970742799716042,
 0.5058393875420183,
 0.8083220422827995,
 0.9563215411007204,
 0.7105704135342897,
 0.5059645986395894,
 0.9970996166198509,
 0.4573749932967047,
 0.4683280112495824,
 0,
 0.7497884386042063,
 0.9716590919096628,
 0.9160931108589663,
 0.9992740153075972,
 0.9429166981001016,
 0.8346598596393029,
 0.9966073138350372,
 0.9964984408301591,
 0.9492348167332397,
 0.8888908413077122,
 0.9653425714140392,
 0.9512698394555559,
 0.9994818217551728]

    errtype  n_np_cor_hour_counts
0         1              0.996232
1         2              0.396507
2         3              0.308780
3         4              0.768909
4         5              0.971812
5         6             -0.235189
6         7              0.441049
7         8             -0.012185
8         9              0.566893
9        10              0.436270
10       11              0.998630
11       12              0.998494
12       13              0.830015
13       14             -0.481140
14       15              0.959335
15       16              0.981257
16       17              0.971533
17       18              0.870023
18       19              0.519587
19       20              0.897074
20       21              0.505839
21       22              0.808322
22       23              0.956322
23       24              0.710570
24       25              0.505965
25       26              0.997100
26       27              0.457375
27       28              0.468328
28       29              0.000000
29       30              0.749788
30       31              0.971659
31       32              0.916093
32       33              0.999274
33       34              0.942917
34       35              0.834660
35       36              0.996607
36       37              0.996498
37       38              0.949235
38       39              0.888891
39       40              0.965343
40       41              0.951270
41       42              0.999482

In [ ]:
pd.merge(codf,errtype_distribution)

,errtype,n_np_cor_hour_counts,count,mean,std,min,25%,50%,75%,max,p_counts,npnumber,p_ratio
0,1,0.996232,950.0,22.645263,18.925383,1.0,2.0,30.0,30.0,171.0,242,708,25.47
1,2,0.396507,390.0,66.920513,352.584466,1.0,2.0,2.0,6.0,4056.0,168,222,43.08
2,3,0.308780,1679.0,18.163788,208.580954,1.0,1.0,2.0,4.0,7239.0,465,1214,27.70
3,4,0.768909,6881.0,187.761372,2774.102374,1.0,1.0,16.0,151.0,195024.0,2298,4583,33.40
4,5,0.971812,11010.0,57.246140,163.044126,1.0,3.0,8.0,35.0,4207.0,4028,6982,36.58
5,6,-0.235189,6467.0,7.798516,47.282503,1.0,1.0,2.0,4.0,1796.0,2662,3805,41.16
6,7,0.441049,7648.0,6.795502,46.745625,1.0,1.0,2.0,4.0,2687.0,3093,4555,40.44
7,8,-0.012185,64.0,2.453125,1.851037,1.0,1.0,2.0,3.0,12.0,13,51,20.31
8,9,0.566893,63.0,1.730159,2.444258,1.0,1.0,1.0,1.0,17.0,38,25,60.32
9,10,0.436270,2360.0,29.166102,236.123915,1.0,1.0,2.0,6.0,7311.0,1134,1226,48.05
10,11,0.998630,14767.0,20.668044,95.277239,1.0,13.0,15.0,16.0,7317.0,4971,9796,33.66
11,12,0.998494,14799.0,21.545172,96.042676,1.0,14.0,15.0,18.0,7324.0,4974,9825,33.61
12,13,0.830015,3711.0,3.266774,24.943569,1.0,1.0,1.0,3.0,1111.0,1667,2044,44.92
13,14,-0.481140,7891.0,30.314536,314.507094,1.0,2.0,4.0,8.0,10765.0,3224,4667,40.86
14,15,0.959335,14545.0,107.426401,67.785539,1.0,64.0,102.0,142.0,1526.0,4978,9567,34.22
15,16,0.981257,14431.0,86.490333,63.414517,1.0,47.0,78.0,114.0,1530.0,4977,9454,34.49
16,17,0.971533,5747.0,7.990778,16.532297,1.0,1.0,4.0,11.0,460.0,2498,3249,43.47
17,18,0.870023,1768.0,1.510747,1.815140,1.0,1.0,1.0,1.0,41.0,1521,247,86.03
18,19,0.519587,419.0,1.584726,1.720786,1.0,1.0,1.0,2.0,23.0,346,73,82.58
19,20,0.897074,1546.0,1.345408,1.139906,1.0,1.0,1.0,1.0,23.0,1333,213,86.22
20,21,0.505839,381.0,1.593176,1.742610,1.0,1.0,1.0,2.0,22.0,316,65,82.94
21,22,0.808322,10281.0,181.256201,657.517370,1.0,28.0,43.0,88.0,15944.0,3975,6306,38.66
22,23,0.956322,10046.0,226.558929,968.268174,1.0,10.0,26.0,79.0,26495.0,3920,6126,39.02
23,24,0.710570,2519.0,15.507741,87.195064,1.0,1.0,2.0,7.0,2866.0,1166,1353,46.29
24,25,0.505965,420.0,2.819048,5.631960,1.0,1.0,1.0,3.0,78.0,360,60,85.71
25,26,0.997100,13026.0,40.764471,19.355023,1.0,31.0,39.0,52.0,235.0,4632,8394,35.56
26,27,0.457375,2267.0,92.691222,779.816197,1.0,1.0,2.0,50.0,26482.0,958,1309,42.26
27,28,0.468328,2275.0,94.654066,809.567512,1.0,1.0,2.0,48.0,27643.0,959,1316,42.15
28,30,0.749788,375.0,1.072000,0.288162,1.0,1.0,1.0,1.0,4.0,260,115,69.33
29,31,0.971659,11091.0,178.977279,392.298912,1.0,103.0,159.0,226.0,37589.0,4153,6938,37.44
30,32,0.916093,1933.0,584.711330,903.120230,1.0,14.0,160.0,809.0,5637.0,927,1006,47.96
31,33,0.999274,11074.0,16.098158,10.244832,1.0,13.0,15.0,16.0,183.0,4138,6936,37.37
32,34,0.942917,3733.0,30.761586,247.943701,1.0,2.0,5.0,13.0,9745.0,1963,1770,52.59
33,35,0.834660,2039.0,4.984306,24.349229,1.0,1.0,1.0,3.0,828.0,1186,853,58.17
34,36,0.996607,8435.0,1.104564,0.334516,1.0,1.0,1.0,1.0,6.0,3262,5173,38.67
35,37,0.996498,8434.0,1.106948,0.343587,1.0,1.0,1.0,1.0,6.0,3259,5175,38.64
36,38,0.949235,1822.0,2.491218,7.223481,1.0,1.0,1.0,2.0,234.0,927,895,50.88
37,39,0.888891,766.0,20.651436,54.690716,1.0,2.0,6.0,18.0,965.0,405,361,52.87
38,40,0.965343,10462.0,69.803384,88.824322,1.0,16.0,43.0,92.0,1695.0,4052,6410,38.73
39,41,0.951270,6142.0,16.178444,28.109564,1.0,2.0,7.0,22.0,969.0,2596,3546,42.27
40,42,0.999482,6382.0,5.374021,3.605925,1.0,2.0,5.0,8.0,33.0,2490,3892,39.02

In [ ]:
errtype_distribution

,errtype,count,mean,std,min,25%,50%,75%,max,p_counts,npnumber,p_ratio
0,1,950.0,22.645263,18.925383,1.0,2.0,30.0,30.0,171.0,242,708,25.47
1,2,390.0,66.920513,352.584466,1.0,2.0,2.0,6.0,4056.0,168,222,43.08
2,3,1679.0,18.163788,208.580954,1.0,1.0,2.0,4.0,7239.0,465,1214,27.70
3,4,6881.0,187.761372,2774.102374,1.0,1.0,16.0,151.0,195024.0,2298,4583,33.40
4,5,11010.0,57.246140,163.044126,1.0,3.0,8.0,35.0,4207.0,4028,6982,36.58
5,6,6467.0,7.798516,47.282503,1.0,1.0,2.0,4.0,1796.0,2662,3805,41.16
6,7,7648.0,6.795502,46.745625,1.0,1.0,2.0,4.0,2687.0,3093,4555,40.44
7,8,64.0,2.453125,1.851037,1.0,1.0,2.0,3.0,12.0,13,51,20.31
8,9,63.0,1.730159,2.444258,1.0,1.0,1.0,1.0,17.0,38,25,60.32
9,10,2360.0,29.166102,236.123915,1.0,1.0,2.0,6.0,7311.0,1134,1226,48.05
10,11,14767.0,20.668044,95.277239,1.0,13.0,15.0,16.0,7317.0,4971,9796,33.66
11,12,14799.0,21.545172,96.042676,1.0,14.0,15.0,18.0,7324.0,4974,9825,33.61
12,13,3711.0,3.266774,24.943569,1.0,1.0,1.0,3.0,1111.0,1667,2044,44.92
13,14,7891.0,30.314536,314.507094,1.0,2.0,4.0,8.0,10765.0,3224,4667,40.86
14,15,14545.0,107.426401,67.785539,1.0,64.0,102.0,142.0,1526.0,4978,9567,34.22
15,16,14431.0,86.490333,63.414517,1.0,47.0,78.0,114.0,1530.0,4977,9454,34.49
16,17,5747.0,7.990778,16.532297,1.0,1.0,4.0,11.0,460.0,2498,3249,43.47
17,18,1768.0,1.510747,1.815140,1.0,1.0,1.0,1.0,41.0,1521,247,86.03
18,19,419.0,1.584726,1.720786,1.0,1.0,1.0,2.0,23.0,346,73,82.58
19,20,1546.0,1.345408,1.139906,1.0,1.0,1.0,1.0,23.0,1333,213,86.22
20,21,381.0,1.593176,1.742610,1.0,1.0,1.0,2.0,22.0,316,65,82.94
21,22,10281.0,181.256201,657.517370,1.0,28.0,43.0,88.0,15944.0,3975,6306,38.66
22,23,10046.0,226.558929,968.268174,1.0,10.0,26.0,79.0,26495.0,3920,6126,39.02
23,24,2519.0,15.507741,87.195064,1.0,1.0,2.0,7.0,2866.0,1166,1353,46.29
24,25,420.0,2.819048,5.631960,1.0,1.0,1.0,3.0,78.0,360,60,85.71
25,26,13026.0,40.764471,19.355023,1.0,31.0,39.0,52.0,235.0,4632,8394,35.56
26,27,2267.0,92.691222,779.816197,1.0,1.0,2.0,50.0,26482.0,958,1309,42.26
27,28,2275.0,94.654066,809.567512,1.0,1.0,2.0,48.0,27643.0,959,1316,42.15
28,30,375.0,1.072000,0.288162,1.0,1.0,1.0,1.0,4.0,260,115,69.33
29,31,11091.0,178.977279,392.298912,1.0,103.0,159.0,226.0,37589.0,4153,6938,37.44
30,32,1933.0,584.711330,903.120230,1.0,14.0,160.0,809.0,5637.0,927,1006,47.96
31,33,11074.0,16.098158,10.244832,1.0,13.0,15.0,16.0,183.0,4138,6936,37.37
32,34,3733.0,30.761586,247.943701,1.0,2.0,5.0,13.0,9745.0,1963,1770,52.59
33,35,2039.0,4.984306,24.349229,1.0,1.0,1.0,3.0,828.0,1186,853,58.17
34,36,8435.0,1.104564,0.334516,1.0,1.0,1.0,1.0,6.0,3262,5173,38.67
35,37,8434.0,1.106948,0.343587,1.0,1.0,1.0,1.0,6.0,3259,5175,38.64
36,38,1822.0,2.491218,7.223481,1.0,1.0,1.0,2.0,234.0,927,895,50.88
37,39,766.0,20.651436,54.690716,1.0,2.0,6.0,18.0,965.0,405,361,52.87
38,40,10462.0,69.803384,88.824322,1.0,16.0,43.0,92.0,1695.0,4052,6410,38.73
39,41,6142.0,16.178444,28.109564,1.0,2.0,7.0,22.0,969.0,2596,3546,42.27
40,42,6382.0,5.374021,3.605925,1.0,2.0,5.0,8.0,33.0,2490,3892,39.02